app/controllers/products_controller.rb

INSERT INTO `products` (`title`, `producer`, `price`, `created_at`, `updated_at`, `image_uid`) VALUES ('Перфоратор BFG 1000', 'BOSCH', 876, '2017-12-10 17:57:56', '2017-12-10 17:57:56', '#<ActionDispatch::Http::UploadedFile:0x007f397cfa6880>')
---
    def create
        @product = Product.new(product_params)
        respond_to do |format|
            if @product.save